In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[1,2,3,4],[5,6,7,8]])

In [8]:
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  1  2  3  4
3  5  6  7  8

In [9]:
df1.head()

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  1  2  3  4
3  5  6  7  8

In [10]:
df.head(2)

Empty DataFrame
Columns: []
Index: []

In [11]:
df.tail(1)

Empty DataFrame
Columns: []
Index: []

In [12]:
df.tail()

Empty DataFrame
Columns: []
Index: []

In [13]:
df1.head()

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  1  2  3  4
3  5  6  7  8

In [14]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [15]:
df1.tail(2)

   0  1  2  3
2  1  2  3  4
3  5  6  7  8

# Slicing

In [16]:
df1.shape

(4, 4)

In [17]:
df1.iloc[2,2]

3

In [18]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

In [19]:
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  1  2  3  4
3  5  6  7  8

In [20]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[1,2,3,4],[5,6,7,8]],columns=['A','B','C','D'])

In [21]:
df1

   A  B  C  D
0  1  2  3  4
1  5  6  7  8
2  1  2  3  4
3  5  6  7  8